In [4]:
import pandas as pd
df = pd.read_csv("outlier_ornek_veriseti.csv", sep=";")
df

      isim  boy
0      can   88
1      ali  132
2    tugce  134
3     ayse  137
4    nihan  139
5    sahin  142
6     kaan  142
7     emre  144
8    bartu  147
9   ismail  148
10  gokalp  149
11   osman  149
12   filiz  150
13    veli  207
14   ilker  234

In [5]:
df.describe()

              boy
count   15.000000
mean   149.466667
std     32.943386
min     88.000000
25%    138.000000
50%    144.000000
75%    149.000000
max    234.000000

In [6]:
Q1 = df.boy.quantile(0.25)
Q1

138.0

In [11]:
Q3 = df.boy.quantile(0.75)
Q3

149.0

In [13]:
IQR_degeri = Q3 - Q1
IQR_degeri

11.0

In [16]:
alt_limit = Q1 - 1.5*IQR_degeri
alt_limit

121.5

In [17]:
ust_limit = Q3 + 1.*IQR_degeri
ust_limit

160.0

In [18]:
df[(df.boy < alt_limit) | (df.boy > ust_limit)]

     isim  boy
0     can   88
13   veli  207
14  ilker  234

In [19]:
df_filtrelenmiş = df[(df.boy > alt_limit) & (df.boy < ust_limit)]

In [20]:
df_filtrelenmiş

      isim  boy
1      ali  132
2    tugce  134
3     ayse  137
4    nihan  139
5    sahin  142
6     kaan  142
7     emre  144
8    bartu  147
9   ismail  148
10  gokalp  149
11   osman  149
12   filiz  150